Repository: yshalsager/personal_website_old
Catalog: personal_website/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: About Me
ar: من أنا؟

source: Blog
ar: المدونة

source: My Works and Projects
ar: أعمالي ومشاريعي

source: Hi yshalsager, I came across your website and would like to get in touch.
ar: مرحبا يوسف، أرغب في التواصل معك بشأن

source: Contact Me
ar: تواصل معي

source: Hi there! I'm Youssif (or better known as yshalsager on the internet), XiaomiFirmwareUpdater Project Lead Developer, XDA Recognized Developer, Self-taught Programmer, and trainee writer at Loghat El-asr magazine.
ar: مرحبا! أنا يوسف، أُعرف على الإنترنت ب (yshalsager). أنا المطور الرئيسي لمشروع XiaomiFirmwareUpdater، ومطور بايثون، وكاتب تقني تحت التدريب بمجلة لغة العصر (مصر).

source: I've been coding in Python since 2018, mostly for web scraping, automation, chat bots, and building other cool <a href="/%(lang)s/projects">projects</a> (most of them are open-source and available on GitHub).<br/><br/> Also, I've been tinkering with Android software development since 2014, building mods, custom recoveries, and custom ROMs for Android devices. You can find my android related works on <a href="https://forum.xda-developers.com/member.php?u=6084385">XDA-Developers Forums</a>.
ar: منذ 2018 وأنا أقوم بتطوير الأدوات والبرامج وبعض المواقع بلغة بايثون، وحاليا أركز بشكل كبير على الأتمتة والبوتات وال web scraping. أغلب مشاريعي مفتوحة المصدر ومتاحة على موقع GitHub <a href="/%(lang)s/projects">هنا</a>.<br/><br/>أيضا أقوم بشكل مستمر بالتعديل على هواتف أندرويد وتطوير الرومات المعدلة منذ 2014، جميع أعمالي متاحة على <a href="https://forum.xda-developers.com/member.php?u=6084385">موقع XDA-Developers.</a>

source: You can checkout my projects <a href="/%(lang)s/projects">here</a>, and if you would like to contact me here's <a href="/%(lang)s/contact">how to reach me out</a>.
ar: يمكنك الإطلاع على قائمة مشاريعي <a href="/%(lang)s/projects">هنا</a>، وإذا رغبت في التواصل معي فيمكنك معرفة كيفية القيام بذلك <a href="/%(lang)s/contact">من هنا</a>.

source: Older Posts
ar: التدوينات الأقدم

source: I'm very open to messages, so, if you want to get in touch you send me a message using any of the methods below and I will get back to you as soon as possible as long as you don't ask to ask and express your intent clearly.
ar: أرحب جدًا بالتواصل إذا كان لديك ما تود النقاش بشأنه. يمكنك استخدام أي من الطرق الموجودة بالأسفل وسأكون سعيدًا بالرد عليك في أقرب وقت ممكن طالما تسأل بشكل مباشر أو تعبر عما تريد بشكل واضح.

source: Telegram
ar: تيليجرام

source: I usually respond faster to Telegram since it's my favourite social platform.
ar: غالبا ما أكون أسرع في الرد على تيليجرام بما أنه منصة التواصل المفضلة لدي.

source: Email
ar: البريد الإلكتروني

source: For traditional email you can click the link to send me a message.
ar: إذا كنت ترغب في استخدام البريد الإلكتروني التقليدي للتواصل يمكنك الضغط على الرابط لإرسال رسالة لي.

source: An Error Occurred
ar: لقد حدث خطأ ما

source: The requested page couldn't be found!
ar: تعذر العثور على الصفحة المطلوبة

source: Internal Server Error :(
ar: حدث خطأ بالخادم :(

source: Unknown Error
ar: خطأ غير معروف

source: Youssif Shaaban Alsager (yshalsager)
ar: يوسف شعبان الصغير (yshalsager)

source: Hi, I'm Youssif Shaaban Alsager.
ar: مرحبا! أنا يوسف شعبان الصغير.

source: Python Developer, XDA Recognized Developer, and Technical Translator/Writer.
ar: مطور بايثون وكاتب/مترجم تقني.

source: Quick Navigate
ar: التنقل السريع

source: Programming
ar: البرمجة

source: Android Software Development
ar: تطوير نظام أندرويد

source: Technical Writing and Translation
ar: الكتابة والترجمة التقنية

source: Most of my projects are open-source and available on <a href="https://github.com/yshalsager">GitHub</a>, some of the prominent ones are:
ar: أغلب مشاريعي مفتوحة المصدر ومتاحة على موقع <a href="https://github.com/yshalsager">GitHub</a>، وهذه أبرز المشاريع التي عملت عليها:

source: Xiaomi Firmware Updater
ar: محدث البرامج الثابتة لهواتف شاومي

source: My most well-known project that aims to provide firmware packages for Xiaomi custom ROMs users. It has been covered by some of the most popular tech websites and forums in the world, including <a href="https://www.xda-developers.com/xiaomi-firmware-updater-tool-miui-roms/" >XDA</a>, <a href="https://4pda.ru/2018/01/31/349457/">4PDA</a>, <a href="https://androidcommunity.com/xiaomi-firmware-updater-provides-updated-firmware-for-most-xiaomi-devices-20180130/" >Android Community</a>, <a href="https://piunikaweb.com/2019/01/16/xiaomi-user-waiting-for-updates-this-new-site-will-help/" >Piunika Web</a>, <a href="https://sourceforge.net/blog/projects-week-november-5-2018/">SourceForge</a>, and many other websites.
ar: أكثر مشروعاتي شهرة، والذي يهدف إلى توفير حزم البرامج الثابتة الخاصة بهواتف شاومي بشكل يسير لمستخدمتي الرومات المعدلة. وقد قامت العديد من المواقع التقنية الأكثر شهرة على مستوي العالم بالكتابة حول المشروع مثل <a href="https://www.xda-developers.com/xiaomi-firmware-updater-tool-miui-roms/" >XDA</a>، و <a href="https://4pda.ru/2018/01/31/349457/">4PDA</a>، و <a href="https://androidcommunity.com/xiaomi-firmware-updater-provides-updated-firmware-for-most-xiaomi-devices-20180130/" >Android Community</a>، و <a href="https://piunikaweb.com/2019/01/16/xiaomi-user-waiting-for-updates-this-new-site-will-help/" >Piunika Web</a>، و <a href="https://sourceforge.net/blog/projects-week-november-5-2018/">SourceForge</a>، والعديد من المواقع الأخرى.

source: This project is a big umbrella for many sub-projects such as
ar: ويعد هذا المشروع بمثابة مظلة كبيرة تحتها عدد من المشاريع الفرعية مثل

source: MIUI Updates Tracker
ar: متتبع تحديثات MIUI

source: Provides Xiaomi devices users with the largest archive of official ROMs and tracks the latest ROMs to notify users on various social channels with updates notifications on time.
ar: والذي يقدم للمستخدمين أكبر أرشيف لرومات هواتف شاومي الرسمية ويقوم بتتبع الإصدارات الجديدة وإرسال تنبيهات للمستخدمين على عدد من منصات التواصل بالتحديثات الجديدة وقت صدورها

source: Xiaomi Flashable Firmware Creator
ar: منشئ حزم البرامج الثابتة

source: A tool that generates flashable firmware-update packages from official MIUI ROMS. Available as a GUI and CLI tool.
ar: أداة تقوم باستخراج البرامج الثابتة من بالتحديثات الرسمية لهواتف شاومي، وهي متاحة كأداة ذات واجهة رسومية ونسخة لسطر الأوامر.

source: Xiaomi Geeks Chat Bot
ar: بوت مهووسي شاومي

source: An all-in-one chatbot that provides easy access for all the stuff that Xiaomi users need, starting from guides and tools, and ending with advanced things like custom recovery and firmware. Currently Available on Telegram and Discord only, but more platforms support to come soon.
ar: بوت دردشة يتيح لمستخدمتي لهواتف شاومي الوصول السريع لمختلف الأشياء التي يحتاجها أي مستخدم. بداية من الشروحات والأدوات وحتى الأمور المتقدمة مثل الريكفري المعدل وحزم البرامج الثابتة. حاليا البوت متاح على منصتي تيليجرام ودسكورد وقريبا سيدعم المزيد من منصات ومواقع التواصل.

source: Xiaomi Certification Tracker
ar: متتبع تراخيص أجهزة شاومي

source: A set of web scrapers that gather Xiaomi products certification info from various websites like TENAA, FCCID, BIS, TÜV SÜD, etc.
ar: عدد من كاشطات الويب التي تقوم بتجميع معلومات التراخيص الخاصة بالأجهزة التي تقوم شاومي بتسجيلها قبل إطلاقها بشكل رسمي.

source: Android Trackers Project
ar: مشروع متتبعات أندرويد

source: A project that tracks various stuff that is related to Android such as <a href="https://github.com/androidtrackers/android-enterprise-devices">Google Enterprise Android devices</a>, <a href="https://github.com/androidtrackers/arcore-devices">Google ARCore devices</a>, <a href="https://github.com/androidtrackers/certified-android-devices">Google Play Certified Android devices</a>, <a href="https://github.com/androidtrackers/aosp-tracker">Android Open Source Project releases</a>, <a href="https://github.com/androidtrackers/codeaurora-releases-tracker">Qualcomm CAF releases</a>, and <a href="https://github.com/androidtrackers/netflix-devices">Netflix supported devices</a>.
ar: مشروع يقوم بمتابعة العديد من الأشياء المتعلقة بنظام أندرويد مثل <a href="https://github.com/androidtrackers/android-enterprise-devices">أجهزة Google Enterprise Android</a>، و<a href="https://github.com/androidtrackers/arcore-devices">أجهزة Google ARCore</a>، و<a href="https://github.com/androidtrackers/certified-android-devices">أجهزة Google Play Certified</a>، و<a href="https://github.com/androidtrackers/aosp-tracker">إصدارات مشروع أندرويد مفتوح المصدر AOSP releases</a>، و<a href="https://github.com/androidtrackers/codeaurora-releases-tracker">إصدارات منتديات كوالكم للتطوير CAF </a>، و<a href="https://github.com/androidtrackers/netflix-devices">الهواتف المدعومة من نتفليكس</a>.

source: Android OEM software updates tracker
ar: مشروع متتبع تحديثات أجهزة أندرويد الرسمية

source: Similar to MIUI Updates Tracker, this project tracks new software updates from Android OEMs, such as <a href="https://github.com/androidtrackers/oneplus-updates-tracker">OnePlus</a> and <a href="https://realmeupdater.com/">Realme</a>.
ar: بشكل مشابة لمشروع متتبع تحديثات MIUI، يقوم هذا المشروع بتتبع آخر تحديثات أجهزة أندرويد من شركاتها الرسمية مثل <a href="https://github.com/androidtrackers/oneplus-updates-tracker">OnePlus</a> و<a href="https://realmeupdater.com/">Realme</a>.

source: Samsung Firmware Bot
ar: بوت رومات هواتف سامسونج

source: A telegram bot to check for and upload Samsung firmware using SamFirm tool.
ar: بوت يعمل على منصة تيليجرام يقوم بالتحقق من تحديثات أجهزة سامسونج التي تعمل بنظام أندرويد كما يوفر إمكانية رفع هذا التحديثات إلى سيرفر مخصص.

source: Also, I have a good history of Android software development since 2014 on <a href="https://forum.xda-developers.com/member.php?u=6084385">XDA-Developers Forums</a>.<br> Some of my previous works are:
ar: كما أن لدي أيضا تاريخ جيد في القيام بتطوير نظام أندرويد منذ 2014 على <a href="https://forum.xda-developers.com/member.php?u=6084385">منتدي XDA-Developers</a>.<br> وهذه بعض أعمالي السابقة:

source: Android Custom ROMs development
ar: تطوير رومات أندرويد المعدلة

source: I used to be involved in the development of Android custom ROMs for devices I own, such as <a href="https://forum.xda-developers.com/redmi-note-5-pro/development/rom-liquidremix-v10-0-xiaomi-note-5-pro-t3865413">Xiaomi Redmi Note 5 Pro</a>, and <a href="https://forum.xda-developers.com/mi-max/development/rom-lineageos-15-1-t3756521">Xiaomi Mi Max</a>.<br> Then, when Android Oreo (8.0) brought <a href="https://forum.xda-developers.com/project-treble">Project Treble</a>, I wrote a guide about how to build a Generic System Image (GSI) on your own <a href="https://forum.xda-developers.com/project-treble/trebleenabled-device-discussion/guide-how-to-build-project-treble-gsi-t3801803">here</a> and maintained a couple of GSI ROMs (<a href="https://forum.xda-developers.com/project-treble/trebleenabled-device-development/8-1-0-xenonhd-t3800543">XenonHD</a> and <a href="https://forum.xda-developers.com/project-treble/trebleenabled-device-development/gsi-benzo-rom-9-0-t3837127">BenzoROM</a>) for some good time.
ar: غالبا ما أنخرط في تطوير الرومات المعدلة مع المطورين الآخرين للهواتف التي أمتلكها مثل <a href="https://forum.xda-developers.com/redmi-note-5-pro/development/rom-liquidremix-v10-0-xiaomi-note-5-pro-t3865413">شاومي نوت 5 برو</a>، و<a href="https://forum.xda-developers.com/mi-max/development/rom-lineageos-15-1-t3756521">شاومي مي ماكس 1</a>.<br> وعندما جلب أندرويد أوريو (8.0) تغييرات <a href="https://forum.xda-developers.com/project-treble">Project Treble</a> قمت بكتابة دليل لكيفية بناء صورة النظام الموحدة (GSI) بنفسك <a href="https://forum.xda-developers.com/project-treble/trebleenabled-device-discussion/guide-how-to-build-project-treble-gsi-t3801803">هنا</a>، كما قمت بالإشراف على صيانة نسختين من رومات الGSI (<a href="https://forum.xda-developers.com/project-treble/trebleenabled-device-development/8-1-0-xenonhd-t3800543">XenonHD</a> و<a href="https://forum.xda-developers.com/project-treble/trebleenabled-device-development/gsi-benzo-rom-9-0-t3837127">BenzoROM</a>) لفترة طويلة من الوقت.

source: Custom Recovery ports
ar: تطوير الريكفري المعدل

source: I have ported Custom recovery like <a href="https://github.com/TeamWin/">TWRP</a> and <a href="https://github.com/RedWolfRecovery">Redwolf</a> for many devices like <a href="https://forum.xda-developers.com/phab-2-pro/development/recovery-twrp-lenovo-phab-2-pro-pb2-690y-t4012893">Lenovo Phab 2 Pro (PB2-690Y)</a>, <a href="https://forum.xda-developers.com/android/development/recovery-twrp-cubot-x18-plus-mt6750t-t3806752">Cubot X18 Plus</a>, <a href="https://forum.xda-developers.com/yu-yureka-black/development/recovery-red-wolf-recovery-project-t3750703">YU Yureka Black</a>, <a href="https://forum.xda-developers.com/redmi-note-5-pro/development/recovery-red-wolf-recovery-project-t3766997">Xiaomi Redmi Note 5 Pro</a>, <a href="https://forum.xda-developers.com/mi-max/development/recovery-red-wolf-recovery-project-t3750171">Xiaomi Mi Max / Mi Max Pro.</a> when I was part of <a href="https://github.com/TwrpBuilder">TwrpBuilder</a> project.
ar: قمت بعمل port أو البناء من المصدر للريكفري المعدل مثل <a href="https://github.com/TeamWin/">TWRP</a> و<a href="https://github.com/RedWolfRecovery">Redwolf</a> لكثير من هواتف أندرويد مثل <a href="https://forum.xda-developers.com/phab-2-pro/development/recovery-twrp-lenovo-phab-2-pro-pb2-690y-t4012893">Lenovo Phab 2 Pro (PB2-690Y)</a>، و<a href="https://forum.xda-developers.com/android/development/recovery-twrp-cubot-x18-plus-mt6750t-t3806752">Cubot X18 Plus</a>، و<a href="https://forum.xda-developers.com/yu-yureka-black/development/recovery-red-wolf-recovery-project-t3750703">YU Yureka Black</a>، و<a href="https://forum.xda-developers.com/redmi-note-5-pro/development/recovery-red-wolf-recovery-project-t3766997">Xiaomi Redmi Note 5 Pro</a>، و<a href="https://forum.xda-developers.com/mi-max/development/recovery-red-wolf-recovery-project-t3750171">Xiaomi Mi Max / Mi Max Pro.</a> وذلك عندما كنت جزءًا من مشروع <a href="https://github.com/TwrpBuilder">TwrpBuilder</a>.

source: <a href="https://github.com/chenxiaolong/DualBootPatcher">DualBootPatcher</a> contributions</b>
ar: بعض المساهمات في مشروع <a href="https://github.com/chenxiaolong/DualBootPatcher">DualBootPatcher</a></b>

source: When DualBootPatcher project was actively under development I used to do some contributions like <a href="https://forum.xda-developers.com/android/software-hacking/guide-dualbootpatcher-build-source-t3663076">this guide</a> about how to bring DualBootPatcher for new Android devices, and added the support of many devices to the project like Nokia X/XL/X2, Samsung Galaxy Win / Core, Xiaomi Mi 6, Mi 4S, Redmi 4A, and Redmi Pro, OnePlus 5, and Samsung Galaxy S8/S8+/Note 8 (Exynos).
ar: قبل أن يتوقف تطوير مشروع DualBootPatcher، اعتدت القيام ببعض المساهمات مثل <a href="https://forum.xda-developers.com/android/software-hacking/guide-dualbootpatcher-build-source-t3663076">هذا الدليل </a> الذي يشرح كيفية إضافة دعم الأجهزة الجديدة إلى DualBootPatcher. كما قمت بإضافة دعم العديد من الهواتف للمشروع مثل Nokia X/XL/X2، وSamsung Galaxy Win / Core، وXiaomi Mi 6 وMi 4S وRedmi 4A، وRedmi Pro، وOnePlus 5، وSamsung Galaxy S8/S8+/Note 8 (نسخة Exynos).

source: I'm an English Translation senior student currently. I have a good experience in translating various technical stuff into Arabic. You can find a partial list of the translations done by me <a href="https://github.com/yshalsager-localizations/Index">here</a>.
ar: حاليًا، أنا طالب بالسنة النهائية في كلية اللغات والترجمة قسم اللغة الإنجليزية، ولدي خبرة جيدة في ترجمة مختلف الأمور التقنية من الإنجليزية إلى العربية. يمكنك الإطلاع على قائمة غير مكتملة بمشاريع الترجمة التي عملت عليها <a href="https://github.com/yshalsager-localizations/Index">هنا</a>.

source: Also, I have been writing at Loghat Al-Asr magazine (Al-Ahram, Egypt) since 2015 as a part of their internship for undergraduate students.<br>As of July 2020, my published articles are more than 70 articles, which can be found <a href="https://drive.google.com/file/d/1qpBAYudAw_LM2bicHGQ1PgiKoFk_lf2r/view?usp=sharing">here</a>.
ar: وإلى جانب ذلك، فأنا أقوم بالكتابة بشكل مستمر في مجلة لغة العصر التابعة لمؤسسة الأهرام بمصر منذ 2015 كجزء من برنامجهم التدريبي للطلبة غير الخرييجين. <br>لدي بالمجلة المطبوعة (حتى شهر يوليو 2020) أكثر من 70 موضوع منشور يمكن الإطلاع عليهم <a href="https://drive.google.com/file/d/1qpBAYudAw_LM2bicHGQ1PgiKoFk_lf2r/view?usp=sharing">هنا</a>.

source: Copyright &copy; yshalsager
ar: جميع الحقوق محفوظة &copy; yshalsager

source: yshalsager
ar: يوسف شعبان الصغير

source: Home
ar: الرئيسية

source: About
ar: من أنا؟

source: Projects
ar: أعمالي

source: Contact
ar: تواصل معي

source: Language
ar: اللغة

source: Arabic
ar: العربية

source: English
ar: الإنجليزية
